archive/before-2018-11-10/2016-10-08-使用org-mode和jekyll写博客.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用org-mode和jekyll写博客</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">使用org-mode和jekyll写博客</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb9c58a">1. 前言</a></li>
<li><a href="#org9d0ae74">2. jekyll</a></li>
<li><a href="#orgcd09feb">3. Org-mode设置</a></li>
<li><a href="#orgce9dd9e">4. 发布到github</a></li>
<li><a href="#org75673d4">5. MISC</a></li>
<li><a href="#org0f28391">6. <span class="todo TODO">TODO</span> 图片</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgbb9c58a" class="outline-2">
<h2 id="orgbb9c58a"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
我一直使用org-mode记笔记，也试用过org-publish来直接发布。不过遇到中
文乱码等问题，一直没有弄好。也使用过org-page来搭建。也达不到我想的效
果。这次折腾一下jekyll。
</p>
</div>
</div>

<div id="outline-container-org9d0ae74" class="outline-2">
<h2 id="org9d0ae74"><span class="section-number-2">2</span> jekyll</h2>
<div class="outline-text-2" id="text-2">
<p>
我的理解，这是一个静态博客的生成和发布工具。它支持markdown、html等。
鉴于我使用org-mode的，利用的就是它对html的支持。
</p>

<p>
jekyll有点像使用latex来写文章，有各种类型的模版。写作者只需要关注文
章本身。最后的样式都由模版来决定。
</p>

<p>
下载好jekyll后直接就可以使用的：
</p>
<pre class="example">
    /tmp ᐅ mkdir jekyll
    /tmp ᐅ cd jekyll
    /tmp/jekyll ᐅ jekyll new .
    New jekyll site installed in /private/tmp/jekyll.
    /tmp/jekyll ᐅ jekyll serve
    WARN: Unresolved specs during Gem::Specification.reset:
    jekyll-watch (~&gt; 1.1)
    WARN: Clearing out unresolved specs.
    Please report a bug if this causes problems.
    Configuration file: /private/tmp/jekyll/_config.yml
    Source: /private/tmp/jekyll
    Destination: /private/tmp/jekyll/_site
    Incremental build: disabled. Enable with --incremental
    Generating...
    done in 0.395 seconds.
    Auto-regeneration: enabled for '/private/tmp/jekyll'
    Configuration file: /private/tmp/jekyll/_config.yml
    Server address: http://127.0.0.1:4000/
    Server running... press ctrl-c to stop.
</pre>

<p>
然后就可以在 <code>http://127.0.0.1:4000/</code> 查看效果了。
</p>

<p>
当前目录结构：
</p>
<pre class="example">
    .
    ├── Gemfile
    ├── Gemfile.lock
    ├── _config.yml
    ├── _posts
    │   └── 2016-10-08-welcome-to-jekyll.markdown
    ├── _site
    │   ├── Gemfile
    │   ├── Gemfile.lock
    │   ├── about
    │   │   └── index.html
    │   ├── css
    │   │   └── main.css
    │   ├── feed.xml
    │   ├── index.html
    │   └── jekyll
    │       └── update
    │           └── 2016
    │               └── 10
    │                   └── 08
    │                       └── welcome-to-jekyll.html
    ├── about.md
    ├── css
    │   └── main.scss
    ├── feed.xml
    └── index.html

    10 directories, 15 files
</pre>

<p>
其中 <code>_config.yml</code> 为总体配置文件， <code>_posts</code> 文件夹存放源文件，最后
会配置org-mode自动把所有的文章都导出到这个目录。 <code>_site</code> 就是最后生
成的整个静态站点。
</p>

<p>
现在先手动新建一个文件 <code>_posts/2016-10-08-test.html</code> 。 <b>需要注意的
是，文件名必须是 <code>XXXX-XX-XX-name</code></b> 的形式，这是jekyll的约定。
</p>
<pre class="example">
    ---
    layout: post
    title:  "This is test"
    date:   2016-10-08 22:44:36 +0800
    categories: jekyll test
    ---

    &lt;p&gt;This is a test for jekyll&lt;/p&gt;
</pre>

<p>
保存好后在根目录 <code>/tmp/jekyll/</code> 下面执行 <code>jekyll serve</code> 再次生成站点，
你会发现这个html中的内容已经出现了。
</p>

<p>
这时的目录结构如下：
</p>
<pre class="example">
    .
    ├── Gemfile
    ├── Gemfile.lock
    ├── _config.yml
    ├── _posts
    │   ├── 2016-10-08-test.html
    │   └── 2016-10-08-welcome-to-jekyll.markdown
    ├── _site
    │   ├── Gemfile
    │   ├── Gemfile.lock
    │   ├── about
    │   │   └── index.html
    │   ├── css
    │   │   └── main.css
    │   ├── feed.xml
    │   ├── index.html
    │   └── jekyll
    │       ├── test
    │       │   └── 2016
    │       │       └── 10
    │       │           └── 08
    │       │               └── test.html
    │       └── update
    │           └── 2016
    │               └── 10
    │                   └── 08
    │                       └── welcome-to-jekyll.html
    ├── about.md
    ├── css
    │   └── main.scss
    ├── feed.xml
    └── index.html

    14 directories, 17 files
</pre>

<p>
知道了这些，就可以选择模版了。我选择的是 <a href="http://jekyllthemes.org/themes/Less-Or-More/">LessOrMore</a> 。
</p>
</div>
</div>

<div id="outline-container-orgcd09feb" class="outline-2">
<h2 id="orgcd09feb"><span class="section-number-2">3</span> Org-mode设置</h2>
<div class="outline-text-2" id="text-3">
<p>
用于发布blog的org源文件开头需要加入下面这段：
</p>
<pre class="example">
    #+OPTIONS: toc:nil 
    #+BEGIN_HTML
    ---
    layout: post
    title: 使用org-mode和jekyll写博客
    excerpt: "描述本博客搭建过程"
    modified: 2016-10-08
    tags: [Orgmode, Jekyll, Blog]
    categories: Blog
    ---

    #+END_HTML


    #+TOC: headlines 1 local
</pre>

<p>
如果使用markdown的话，其实只需要在文间最前面加入下面这一段就可以了。
这就是设置layout<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>，文章标题，简介等等啦。
我这个模版还支持tag和categories分类等。
</p>
<pre class="example">
    ---
    layout: post
    title: 使用org-mode和jekyll写博客
    ---
    
    正文。
</pre>

<p>
由于我是org-mode导出到html。 <code>#+BEGIN_HTML</code> 里面的内容不会加入到最前，
默认前面会有目录。
</p>

<p>
<code>#+OPTIONS: toc:nil</code> 这一句是先关闭目录。然后使用 <code>#+BEGIN_HTML</code> 设
置layout，标题等。
</p>

<p>
<code>#+TOC: headlines 1 local</code> 再把目录加入进来。这样导出来的html，就会
在最前面加入我们对layout等的设置。而且目录也不会少了。
</p>

<p>
使用org-publish来把org文件全部发布为html，新增如下配置：
</p>
<div class="org-src-container">
<pre class="src src-lisp">    (setq org-publish-project-alist
          '(

            (<span style="color: #ff4ea3;">"org-source"</span>
             <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Path to your org files.</span>
             <span style="color: #d18aff;">:base-directory</span> <span style="color: #ff4ea3;">"~/blog/org/"</span>
             <span style="color: #d18aff;">:base-extension</span> <span style="color: #ff4ea3;">"org"</span>
             <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Path to your Jekyll project. This is where your template</span>
             <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">reside</span>
             <span style="color: #d18aff;">:publishing-directory</span> <span style="color: #ff4ea3;">"~/blog/jekyll/"</span>
             <span style="color: #d18aff;">:recursive</span> t
             <span style="color: #d18aff;">:publishing-function</span> org-html-publish-to-html
             <span style="color: #d18aff;">:headline-levels</span> 4 
             <span style="color: #d18aff;">:html-extension</span> <span style="color: #ff4ea3;">"html"</span>
             <span style="color: #d18aff;">:body-only</span> t <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Only export section between &lt;body&gt; &lt;/body&gt;</span>
             )))
</pre>
</div>

<p>
配置比较简单，对应目录修改一下就可以了。 <code>:body-only t</code> 这一句表求只
需要html中的body啦。其它东西都不要<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>

<p>
配置好后，使用 <code>org-publish</code> 就可以发布写好的文档了。
</p>
</div>
</div>

<div id="outline-container-orgce9dd9e" class="outline-2">
<h2 id="orgce9dd9e"><span class="section-number-2">4</span> 发布到github</h2>
<div class="outline-text-2" id="text-4">
<p>
写好org源文件，发布到jekyll的 <code>_posts</code> 目录后，就可以在jekyll根目录执
行 <code>jekyll serve</code> 命令来在本地查看结果了。如果不想查看结果，可以直接
<code>jekyll build</code> 重新生成一下。执行任一操作后， <code>_site</code> 目录下就是一个完
整的静态博客了。接下来就是如何在公网上显示的问题了。
</p>

<p>
github有提供pages的功能。有两种方式可以使用。
</p>

<p>
比如我的用户名是 <code>pengpengxp</code> ，一种方式是使用我的账户新建一个叫
<code>pengpengxp.github.io</code> 的仓库。把 <code>_site</code> 目录下面的内容全部push到这个
仓库，push的分支是master。然后直接访问 <code>pengpengxp.github.io</code> 这个地址
就可以了。
</p>

<p>
第二种方法，新建一个任意名字的仓库如 <code>jekyll</code> 。把 <code>_site</code> 目录下面的
内容全部push到这个仓库，push的分支是gh-pages<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>。
然后就可以访问 <code>www.github.com/pengpengxp/jekyll</code> 。
</p>

<p>
这里我使用的是第一种，第二种方法没有试过 :)
</p>
</div>
</div>

<div id="outline-container-org75673d4" class="outline-2">
<h2 id="org75673d4"><span class="section-number-2">5</span> MISC</h2>
<div class="outline-text-2" id="text-5">
<p>
写博客的时候不需要手动输入时间，可以使用下面两个函数：
</p>
<div class="org-src-container">
<pre class="src src-lisp">    (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-insert-blog-timestamp</span> ()
      <span style="color: #ff4b4b;">"insert time of today for writing blog"</span>
      (interactive)
      (insert (format-time-string <span style="color: #ff4ea3;">"%Y-%m-%d"</span>)))


    (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-write-blog</span> ()
      (interactive)
      (<span style="color: #a1db00;">let</span> ((filename (concat <span style="color: #ff4ea3;">"~/blog/org/_posts/"</span>
                       (format-time-string <span style="color: #ff4ea3;">"%Y-%m-%d-"</span>)
                              (read-from-minibuffer <span style="color: #ff4ea3;">"Blog title: "</span> )
                              <span style="color: #ff4ea3;">".org"</span>)))
        (<span style="color: #a1db00;">progn</span>
          (find-file filename)
          (message <span style="color: #ff4ea3;">"%s"</span> filename)
          )))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f28391" class="outline-2">
<h2 id="org0f28391"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> 图片</h2>
<div class="outline-text-2" id="text-6">
<p>
图片现在还没有一种优雅的解决方案。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">也就是我前文提到的模版</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">因为其它样式等等都由jekyll搞
定了。</div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara">这是github规定的。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>